AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/лб_ДанныеГорГаза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>лб_ДанныеГорГаза</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКоррекцииСальдо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_РазовыеПоУслугамЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановкаИзменениеУслугЛС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_УстановкаИзменениеУслугПоЛС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКоррекцииСальдоЛВБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_РазовыеПоУслугамЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрагизацияЛВБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норматив</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоПени</Name>
							<Comment>Не использ.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пени</Name>
							<Comment>Не использ.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеСчетчика</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСчетчика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекПоказание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Режим</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЕдиницПотребления</Name>
							<Comment>На конец месяца расчета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/лб_ГорГаз/Ext/Module.bsl
//Параметры
//	Дата - любая дата в рамках месяца
//  Организация
//
//По входящим параметрам находит документ лб_ДанныеГорГаза, приводит сальдо по регистру бит_ВзаиморасчетыПоУслугамЖКХ равной полю "Сальдо" из
//табличной части документа, заполняет документ бит_РазовыеПоУслугамЖКХ - реквизит "ДокументКоррекцииСальдо" документа лб_ДанныеГорГаза. 
Процедура КоррекцияСальдоГорГаз(Дата, Организация, Результат="") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	лб_ДанныеГорГаза.Ссылка КАК Ссылка,
	               |	лб_ДанныеГорГаза.ДокументКоррекцииСальдо КАК ДокументКоррекцииСальдо
	               |ИЗ
	               |	Документ.лб_ДанныеГорГаза КАК лб_ДанныеГорГаза
	               |ГДЕ
	               |	лб_ДанныеГорГаза.Дата МЕЖДУ &ДатаН И &ДатаК
	               |	И НЕ лб_ДанныеГорГаза.ПометкаУдаления
	               |	И лб_ДанныеГорГаза.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ДатаК", КонецДня(КонецМесяца(Дата)));
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(НачалоМесяца(Дата)));
	Запрос.УстановитьПараметр("Организация", Организация);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ДокументКоррекцииСальдо = Выборка.ДокументКоррекцииСальдо;
	ДокументДанныеГорГаза = Выборка.Ссылка;
	ОбъектКоррекцияСальдо = ДокументКоррекцииСальдо.ПолучитьОбъект();
	ОбъектКоррекцияСальдо.СписокУслуг.Очистить();
	ОбъектКоррекцияСальдо.Записать(РежимЗаписиДокумента.Проведение);
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	лб_ДанныеГорГазаТЧ.ЛицевойСчет КАК ЛицевойСчет,
	               |	лб_ДанныеГорГазаТЧ.Ссылка.Услуга КАК Услуга,
	               |	ЕСТЬNULL(лб_ДанныеГорГазаТЧ.Сальдо, 0) КАК Сальдо
	               |ПОМЕСТИТЬ ВТ_ДанныеГорГаз
	               |ИЗ
	               |	Документ.лб_ДанныеГорГаза.ТЧ КАК лб_ДанныеГорГазаТЧ
	               |ГДЕ
	               |	лб_ДанныеГорГазаТЧ.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	               |	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ КАК УслугаЖКХ,
	               |	бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток КАК СуммаОстаток
	               |ПОМЕСТИТЬ ВТ_ДанныеРегистра
	               |ИЗ
	               |	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
	               |			&ПериодСальдо,
	               |			УслугаЖКХ = &УслугаЖКХ
	               |				И Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеГорГаз.ЛицевойСчет КАК ЛицевойСчет,
	               |	ВТ_ДанныеГорГаз.Услуга КАК Услуга,
	               |	1 КАК Сумма,
	               |	Неопределено КАК Субконто1,
	               |	Неопределено КАК Субконто2,
	               |	Неопределено КАК Субконто3,
	               |	Неопределено КАК СубконтоКУ1,
	               |	Неопределено КАК СубконтоКУ2,
	               |	Неопределено КАК СубконтоКУ3,
	               |	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетАбонента,
	               |	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКУ,
	               |	ЕстьNULL(ВТ_ДанныеРегистра.СуммаОстаток,0) КАК РегистрОстаток,
	               |	ВТ_ДанныеГорГаз.Сальдо КАК ГорГазСальдо
	               |ИЗ
	               |	ВТ_ДанныеГорГаз КАК ВТ_ДанныеГорГаз
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	               |		ПО ВТ_ДанныеГорГаз.ЛицевойСчет = ВТ_ДанныеРегистра.ЛицевойСчет
	               |			И ВТ_ДанныеГорГаз.Услуга = ВТ_ДанныеРегистра.УслугаЖКХ";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументДанныеГорГаза);
	Запрос.УстановитьПараметр("УслугаЖКХ", ДокументДанныеГорГаза.Услуга);
	Запрос.УстановитьПараметр("Организация", Организация);
	//+++ 1bit 28.05.2019 08:17 Шашев Ю. - 
	//Запрос.УстановитьПараметр("ПериодСальдо", Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодСальдо", НачалоМесяца(Дата)); 	
	//--- 1bit 28.05.2019 Шашев Ю.
	
	
	
	ТабЛицевыеСчета = Запрос.Выполнить().Выгрузить();
	
	СписокЛС = ТабЛицевыеСчета.ВыгрузитьКолонку("ЛицевойСчет");
	Колонки  = ТабЛицевыеСчета.Колонки;
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ТабЛицевыеСчета, Колонки, СписокЛС, Организация , Дата);
	
	Для Каждого Строка Из ТабЛицевыеСчета Цикл
		Строка.Сумма = Строка.ГорГазСальдо - Строка.РегистрОстаток;
	КонецЦикла;
	
	
	ОбъектКоррекцияСальдо.СписокУслуг.Загрузить(ТабЛицевыеСчета);
	ОбъектКоррекцияСальдо.Записать(РежимЗаписиДокумента.Проведение);
	
	Результат = "Успешно выполнено!";

КонецПроцедуры
